# Задача 19. Реализовать алгоритм задания случайных чисел. Без использования встроенного генератора псевдослучайных чисел

import os
from time import time
os.system("cls")

print(time() % 10/10, '\n')